# Data integration

## Concatenation

In [1]:

import pandas as pd

In [2]:
df1 = pd.DataFrame(
    {"acc":[1,2,3] ,"name":[0,9,8] , "age":[2,4,6]}
)


df2 = pd.DataFrame(
    {"acc":[5,9,10] ,"loan":[45,55,8] , 
    }
)

In [3]:
df1

   acc  name  age
0    1     0    2
1    2     9    4
2    3     8    6

In [4]:
df2

   acc  loan
0    5    45
1    9    55
2   10     8

In [5]:
row_concat = pd.concat([df1,df2],axis=0)

In [6]:
row_concat

   acc  name  age  loan
0    1   0.0  2.0   NaN
1    2   9.0  4.0   NaN
2    3   8.0  6.0   NaN
0    5   NaN  NaN  45.0
1    9   NaN  NaN  55.0
2   10   NaN  NaN   8.0

In [7]:

column_concat = pd.concat([df1,df2],axis=1)

In [8]:
column_concat

   acc  name  age  acc  loan
0    1     0    2    5    45
1    2     9    4    9    55
2    3     8    6   10     8

## merge

In [9]:
df3 = pd.DataFrame(
    {"key":["A","B","C","D"] ,"id":[0,9,8,7] , "ac":[2,4,6,9]}
)

In [10]:
df4 = pd.DataFrame(
    {"key":["E","B","G","A"] ,"name":[0,9,8,7] , "ac":[2,4,6,9]}
)

In [11]:
df3

  key  id  ac
0   A   0   2
1   B   9   4
2   C   8   6
3   D   7   9

In [12]:
df4

  key  name  ac
0   E     0   2
1   B     9   4
2   G     8   6
3   A     7   9

In [13]:
pd.merge(df3,df4,how="inner",on="key",suffixes=("_df1","_df2"))

  key  id  ac_df1  name  ac_df2
0   A   0       2     7       9
1   B   9       4     9       4

In [14]:
pd.merge(df3,df4,how="outer",on="key",suffixes=("_df1","_df2"))

  key   id  ac_df1  name  ac_df2
0   A  0.0     2.0   7.0     9.0
1   B  9.0     4.0   9.0     4.0
2   C  8.0     6.0   NaN     NaN
3   D  7.0     9.0   NaN     NaN
4   E  NaN     NaN   0.0     2.0
5   G  NaN     NaN   8.0     6.0

In [15]:
pd.merge(df3,df4,how="left",on="key",suffixes=("_df1","_df2"))

  key  id  ac_df1  name  ac_df2
0   A   0       2   7.0     9.0
1   B   9       4   9.0     4.0
2   C   8       6   NaN     NaN
3   D   7       9   NaN     NaN

In [16]:
pd.merge(df3,df4,how="right",on="key",suffixes=("_df1","_df2"))

  key   id  ac_df1  name  ac_df2
0   E  NaN     NaN     0       2
1   B  9.0     4.0     9       4
2   G  NaN     NaN     8       6
3   A  0.0     2.0     7       9

In [17]:
#merge with df
df3.merge(df4,how="inner",on="key")

  key  id  ac_x  name  ac_y
0   A   0     2     7     9
1   B   9     4     9     4

# joining

In [18]:
df4 = pd.DataFrame(
    {"key":["A","B","C","D"] ,"id":[0,9,8,7] , "ac":[2,4,6,9]}
)

In [22]:
df5 = pd.DataFrame(
    {"key":["P","B","y","o"] ,"id":[1,4,2,6] , "ac":[21,24,36,49]}
)

In [23]:
df4.join(df5,how="inner" ,lsuffix ="_x")

  key_x  id_x  ac_x key  id  ac
0     A     0     2   P   1  21
1     B     9     4   B   4  24
2     C     8     6   y   2  36
3     D     7     9   o   6  49

In [24]:
df5.join(df4,how="right" ,rsuffix ="_2")

  key  id  ac key_2  id_2  ac_2
0   P   1  21     A     0     2
1   B   4  24     B     9     4
2   y   2  36     C     8     6
3   o   6  49     D     7     9

# Stacking

In [26]:

df7 = pd.DataFrame(
    {"key":["A","B","C","D"] ,"id":[0,9,8,7] , "ac":[2,4,6,9]},index=["w","x","y","z"]
)

In [27]:
df7

  key  id  ac
w   A   0   2
x   B   9   4
y   C   8   6
z   D   7   9

In [28]:
stacked = df7.stack()

In [29]:
stacked

w  key    A
   id     0
   ac     2
x  key    B
   id     9
   ac     4
y  key    C
   id     8
   ac     6
z  key    D
   id     7
   ac     9
dtype: object

In [30]:
stacked.unstack()

  key id ac
w   A  0  2
x   B  9  4
y   C  8  6
z   D  7  9